Repository: CofficLab/Lumi
Catalog: Plugins/BrewManagerPlugin/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: All packages are up to date
zh_hans: 所有包都是最新的
zh_hk: 所有套件都是最新的

source: Automatically detects Homebrew installation status. Shows clear guidance when Homebrew is not installed.
zh_hans: 自动检测 Homebrew 安装状态。当未安装 Homebrew 时显示清晰指引。
zh_hk: 自动检测 Homebrew 安装状态。当未安装 Homebrew 时显示清晰指引。

source: Background services
zh_hans: 后台服务
zh_hk: 后台服务

source: Batch Upgrade
zh_hans: 批量升级
zh_hk: 批量升级

source: Batch update failed: %@
zh_hans: 批量更新失败：%@
zh_hk: 批量更新失敗：%@

source: Browse Packages
zh_hans: 浏览包
zh_hk: 浏览包

source: Browse all installed Homebrew formulae and casks. View package details including version, installation date, and dependencies.
zh_hans: 浏览所有已安装的 Homebrew formula 和 cask。查看包详情，包括版本、安装日期和依赖关系。
zh_hk: 浏览所有已安装的 Homebrew formula 和 cask。查看包详情，包括版本、安装日期和依赖关系。

source: Casks
zh_hans: Cask（GUI 应用）
zh_hk: Cask（GUI 应用）

source: Command-line tools and libraries
zh_hans: 命令行工具和库
zh_hk: 命令行工具和库

source: Dismiss
zh_hans: 关闭
zh_hk: 关闭

source: Download and install a package
zh_hans: 下载并安装包
zh_hk: 下载并安装包

source: Enter keywords to start searching
zh_hans: 输入关键词开始搜索
zh_hk: 輸入關鍵字開始搜尋

source: Environment Check
zh_hans: 环境检测
zh_hk: 环境检测

source: Error
zh_hans: 错误
zh_hk: 錯誤

source: Find packages in Homebrew
zh_hans: 在 Homebrew 中查找包
zh_hk: 在 Homebrew 中查找包

source: Fonts
zh_hans: 字体
zh_hk: 字体

source: Formulae
zh_hans: Formula（命令行工具）
zh_hk: Formula（命令行工具）

source: Homebrew installed (/opt/homebrew)
zh_hans: 已安装 Homebrew（/opt/homebrew）
zh_hk: 已安装 Homebrew（/opt/homebrew）

source: Homebrew not detected, please install Homebrew first.
zh_hans: 未检测到 Homebrew，请先安装 Homebrew。
zh_hk: 未檢測到 Homebrew，請先安裝 Homebrew。

source: Identify packages with available updates. See current vs. latest version at a glance to plan your upgrade strategy.
zh_hans: 识别有可用更新的包。一目了然地查看当前版本与最新版本，规划升级策略。
zh_hk: 识别有可用更新的包。一目了然地查看当前版本与最新版本，规划升级策略。

source: Info
zh_hans: 详情
zh_hk: 详情

source: Install
zh_hans: 安装
zh_hk: 安裝

source: Install & Uninstall
zh_hans: 安装与卸载
zh_hk: 安装与卸载

source: Install new packages or uninstall existing ones. Monitor installation progress and handle errors gracefully.
zh_hans: 安装新包或卸载已有包。监控安装进度并优雅处理错误。
zh_hk: 安装新包或卸载已有包。监控安装进度并优雅处理错误。

source: Install, upgrade, and remove Homebrew formulae
zh_hans: 安装、升级和删除 Homebrew 软件包
zh_hk: 安裝、升級和刪除 Homebrew 軟體套件

source: Installation failed: %@
zh_hans: 安装失败：%@
zh_hk: 安裝失敗：%@

source: Installed
zh_hans: 已安装
zh_hk: 已安裝

source: Installed Packages
zh_hans: 已安装的包
zh_hk: 已安装的包

source: Installed: %@
zh_hans: 已安装：%@
zh_hk: 已安裝：%@

source: Learn More
zh_hans: 了解更多
zh_hk: 了解更多

source: Manage Homebrew packages and casks
zh_hans: 管理 Homebrew 包和 cask
zh_hk: 管理 Homebrew 套件和 cask

source: No packages installed
zh_hans: 未安装任何包
zh_hk: 未安裝任何套件

source: No related packages found
zh_hans: 未找到相关包
zh_hk: 未找到相關套件

source: OK
zh_hans: 确定
zh_hk: 確定

source: Open Package Management from the sidebar to manage brew.
zh_hans: 从侧边栏打开软件包管理来管理 brew。
zh_hk: 從側邊欄開啟軟體套件管理來管理 brew。

source: Package Management
zh_hans: 包管理
zh_hk: 套件管理

source: Package Search
zh_hans: 包搜索
zh_hk: 包搜索

source: Packages & casks
zh_hans: 软件包和 cask
zh_hk: 軟體套件和 cask

source: Processing...
zh_hans: 处理中...
zh_hk: 處理中...

source: Quick Actions
zh_hans: 快捷操作
zh_hk: 快捷操作

source: Refresh
zh_hans: 刷新
zh_hk: 重新整理

source: Refresh and upgrade everything in one place
zh_hans: 在一个地方刷新和升级所有内容
zh_hk: 在一個地方重新整理和升級所有內容

source: Refresh failed: %@
zh_hans: 刷新失败：%@
zh_hk: 重新整理失敗：%@

source: Remove a package from your system
zh_hans: 从系统中移除包
zh_hk: 从系统中移除包

source: Requirements
zh_hans: 系统要求
zh_hk: 系统要求

source: Retry
zh_hans: 重试
zh_hk: 重试

source: Search
zh_hans: 搜索
zh_hk: 搜尋

source: Search Homebrew packages...
zh_hans: 搜索 Homebrew 包...
zh_hk: 搜索 Homebrew 包...

source: Search Homebrew repository for new packages. Browse descriptions, homepages, and installation instructions.
zh_hans: 搜索 Homebrew 仓库查找新包。浏览描述、主页和安装说明。
zh_hk: 搜索 Homebrew 仓库查找新包。浏览描述、主页和安装说明。

source: Search failed: %@
zh_hans: 搜索失败：%@
zh_hk: 搜尋失敗：%@

source: Search the Homebrew repository to install your first formula or cask, then come back here to manage updates and uninstalls.
zh_hans: 搜索 Homebrew 仓库安装你的第一个 formula 或 cask，然后回到这里管理更新和卸载。
zh_hk: 搜索 Homebrew 仓库安装你的第一个 formula 或 cask，然后回到这里管理更新和卸载。

source: Services
zh_hans: 服务
zh_hk: 服务

source: Something went wrong
zh_hans: 出错了
zh_hk: 出错了

source: Stay up to date
zh_hans: 保持更新
zh_hk: 保持更新

source: Supported Package Types
zh_hans: 支持的包类型
zh_hk: 支持的包类型

source: Swift 6.0 or later
zh_hans: Swift 6.0 或更高版本
zh_hk: Swift 6.0 或更高版本

source: System fonts
zh_hans: 系统字体
zh_hk: 系统字体

source: Uninstall
zh_hans: 卸载
zh_hk: 解除安裝

source: Uninstallation failed: %@
zh_hans: 卸载失败：%@
zh_hk: 解除安裝失敗：%@

source: Update
zh_hans: 更新
zh_hk: 更新

source: Update All
zh_hans: 更新全部
zh_hk: 更新全部

source: Update Checker
zh_hans: 更新检查器
zh_hk: 更新检查器

source: Update all outdated packages
zh_hans: 更新所有过期的包
zh_hk: 更新所有过期的包

source: Update failed: %@
zh_hans: 更新失败：%@
zh_hk: 更新失敗：%@

source: Update to the latest version
zh_hans: 更新到最新版本
zh_hk: 更新到最新版本

source: Updates
zh_hans: 更新
zh_hk: 更新

source: Upgrade
zh_hans: 升级
zh_hk: 升级

source: Upgrade All
zh_hans: 全部升级
zh_hk: 全部升级

source: Upgrade all outdated packages at once, or selectively upgrade individual packages. Keep your system fresh.
zh_hans: 一次性升级所有过期的包，或选择性升级单个包。保持系统最新。
zh_hk: 一次性升级所有过期的包，或选择性升级单个包。保持系统最新。

source: Version: %@
zh_hans: 版本：%@
zh_hk: 版本：%@

source: View
zh_hans: 视图
zh_hk: 檢視

source: View package details and dependencies
zh_hans: 查看包详情和依赖关系
zh_hk: 查看包详情和依赖关系

source: macOS 14.0 or later
zh_hans: macOS 14.0 或更高版本
zh_hk: macOS 14.0 或更高版本

source: macOS GUI applications
zh_hans: macOS 图形界面应用
zh_hk: macOS 图形界面应用
